; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v4 - type_3 ?v6 - type_1)
 	      (pred_2 ?v2 - object ?v6 - type_1)
	      (pred_1 ?v4 - type_3 ?v1 - type_2)
	      (pred_3 ?v4 - type_3 ?v2 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v4 - type_3 ?v5 ?v3 - type_1)
       :precondition (and  (pred_4 ?v4 ?v5))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_3 ?v8 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v7) (pred_4 ?v4 ?v7) (pred_1 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v7)) 
		    (not (pred_1 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_3 ?v8 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v8 ?v1) (pred_4 ?v4 ?v7))
       :effect (and (pred_2 ?v8 ?v7)
		    (pred_1 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_04 - type_3
obj_13 obj_01 obj_02 obj_06 - type_2
obj_10 obj_05 obj_03 obj_11 - type_1
obj_08 obj_12 obj_09 - object)
(:init
(pred_4 obj_07 obj_10)
(pred_1 obj_07 obj_13)
(pred_1 obj_07 obj_01)
(pred_4 obj_04 obj_11)
(pred_1 obj_04 obj_02)
(pred_1 obj_04 obj_06)
(pred_2 obj_08 obj_03)
(pred_2 obj_12 obj_10)
(pred_2 obj_09 obj_11)
)
(:goal
(and
(pred_2 obj_08 obj_03)
(pred_2 obj_12 obj_11)
(pred_2 obj_09 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_07 obj_11) (pred_4 obj_04 obj_11))))
  )
)
)

; plan
1. (op_2 obj_04 obj_09 obj_11 obj_06)
   deleted: (pred_2 obj_09 obj_11) (pred_1 obj_04 obj_06)
   added: (pred_3 obj_04 obj_09 obj_06)
   goals met: 1 of 3
2. (op_2 obj_07 obj_12 obj_10 obj_01)
   deleted: (pred_2 obj_12 obj_10) (pred_1 obj_07 obj_01)
   added: (pred_3 obj_07 obj_12 obj_01)
   goals met: 1 of 3
3. (op_3 obj_04 obj_11 obj_03)
   deleted: (pred_4 obj_04 obj_11)
   added: (pred_4 obj_04 obj_03)
   goals met: 1 of 3
4. (op_3 obj_07 obj_10 obj_11)
   deleted: (pred_4 obj_07 obj_10)
   added: (pred_4 obj_07 obj_11)
   goals met: 1 of 3
5. (op_1 obj_07 obj_12 obj_11 obj_01)
   deleted: (pred_3 obj_07 obj_12 obj_01)
   added: (pred_2 obj_12 obj_11) (pred_1 obj_07 obj_01)
   goals met: 2 of 3
6. (op_1 obj_04 obj_09 obj_03 obj_06)
   deleted: (pred_3 obj_04 obj_09 obj_06)
   added: (pred_2 obj_09 obj_03) (pred_1 obj_04 obj_06)
   goals met: 3 of 3
